# Клас Point демонструє базову ООП-концепцію: дані + поведінка.
class Point:
    # Атрибути класу (спільні для всіх екземплярів, якщо не перевизначені).
    x: float = 0
    y: float = 0

def main() -> None :
    p1 = Point()  # Створення об'єкта.
    p2 = Point()  # Створення другого об'єкта.
    Point.x = 10  # Зміна атрибуту класу для всіх екземплярів.
    print(f"p1: ({p1.x}, {p1.y})")  # Використовуємо атрибути класу.
    print(f"p2: ({p2.x}, {p2.y})")
    p1.x = 5  # Створення атрибуту екземпляра (перекриває атрибут класу).
    print(f"p1: ({p1.x}, {p1.y})")
    print(f"p2: ({p2.x}, {p2.y})")
    del p1.x  # Видаляємо атрибут екземпляра, повертаємось до атрибуту класу.
    print(f"p1: ({p1.x}, {p1.y})")
    print(f"p2: ({p2.x}, {p2.y})")
    


if __name__ == "__main__" :
    main()
